Catalogs/МЙ_ПользовательВетис.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>МЙ_ПользовательВетис</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>login</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательСистемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/МЙ_ПользовательВетис/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Если НЕ ПометкаУдаления Тогда
		//Проверка дублей пользователя системы
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	МЙ_ПользовательВетис.Ссылка
		|ИЗ
		|	Справочник.МЙ_ПользовательВетис КАК МЙ_ПользовательВетис
		|ГДЕ
		|	МЙ_ПользовательВетис.Ссылка <> &Ссылка
		|	И МЙ_ПользовательВетис.ПользовательСистемы = &Пользователь
		|	И МЙ_ПользовательВетис.Организация = &Организация
		|	И НЕ МЙ_ПользовательВетис.ПометкаУдаления");
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Пользователь", ПользовательСистемы);
		Запрос.УстановитьПараметр("Организация", Организация);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Сообщить(?(ЗначениеЗаполнено(ПользовательСистемы), "Для пользователя " + ПользовательСистемы, "В качестве значения по умолчанию") + " уже создан элемент " + Выборка.Ссылка, СтатусСообщения.ОченьВажное);
			Отказ = Истина;
			Возврат;
		КонецЕсли; 
	КонецЕсли;	
КонецПроцедуры
